// 1. Логічні оператори  порівняння та alert:
/*
Створіть змінні number1 та number2 і використайте оператори порівняння, щоб визначити, чи вони рівні.

Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа. */

let num1 = 10;
let num2 = 11;
let num3 = 11;

console.log(alert(`${num1 == num2}`));
console.log(alert(`${num2 == num3}`));

/* 2. Метод вводу інформації та логічні порівняння:

Використовуючи prompt, запросіть у користувача введення числа.

Перевірте, чи введене число парне чи непарне.

Виведіть результат з використанням console.log. */

let num = parseFloat(prompt("Введіть число"));
let checkNum = `Введене число є парне: ${num % 2 === 0}`;
console.log(checkNum);

/* 3. Логічні порівняння та введення-виведення:

Використовуючи prompt, запитайте у користувача його вік.

Перевірте, чи вік менше 18 років.

Виведіть відповідне повідомлення про те, чи може користувач використовувати певний ресурс. */

let age = parseInt(prompt("Введіть свій вік:"));
let checkAge = `У користувача є доступ до інформації бо його вік 18+ ${
  age >= 18
}`;
console.log(checkAge);

/* 4. Розрахунок вартості товару та console.log:

Створіть змінну ціна та кількість товару і присвойте їм значення використовуючи prompt .

Використовуйте математичні операції для обчислення вартості товару (ціна * кількість).

Виведіть результат за допомогою console.log. */

let price = parseFloat(prompt("Введіть ціну"));

let quantity = parseFloat(prompt("Введіть кількість"));

let totalCost = `Загальна сума товару це ${price * quantity}`;

console.log(`Сума виходить:${totalCost}`);


/* 5. Розрахунок знижки на товар та alert:

Використовуючи prompt, запросіть в користувача вартість товару.

Розрахуйте знижку на товар у розмірі 50% від введеної вартості.

Виведіть результат знижки за допомогою alert. */

let oldPrice = parseFloat(prompt("Введіть стару ціну"))
let discount = oldPrice*0.5
let newPrice = discount
console.log(alert(`new price is ${newPrice}`));