        // Запитуємо висоту і ширину прямокутника у користувача
        let height = parseInt(prompt("Введіть висоту прямокутника: "));
        let width = parseInt(prompt("Введіть ширину прямокутника: "));

        // Ініціалізуємо порожній рядок, який буде містити наш прямокутник
        let rectangle = "";

        // Створюємо верхній рядок прямокутника
        rectangle += '*'.repeat(width) + "<br>";

        // Створюємо середні рядки прямокутника (порожні всередині)
        for (let i = 1; i < height - 1; i++) {
            rectangle += '*' + ' '.repeat(width - 2) + '*' + "<br>";
        }

        // Створюємо нижній рядок прямокутника, якщо висота більша за 1
        if (height > 1) {
            rectangle += '*'.repeat(width) + "<br>";
        }

        // Виводимо прямокутник на веб-сторінку, обгортаючи його у тег <pre>
        document.write(rectangle + "<pre/>" + rectangle)